/*
 *********************************************************************************************************
 *                                           Single Wire Bus
 *
 *                            (c) Copyright 1999, John, All Rights Reserved
 *
 *********************************************************************************************************
 */
#include <stdint.h>
#include "1-wire.h"
/*
 *********************************************************************************************************
 */
/*
 *********************************************************************************************************
 */
/*
*********************************************************************************************************
 * container_of - cast a member of a structure out to the containing structure
 *     
 * @ptr:        the pointer to the member.
 * @type:       the type of the container struct this is embedded in.
 * @member:     the name of the member within the struct.
*********************************************************************************************************
*/
uint16_t get_temperature(void)
{  
    uint16_t t;
    float ft;
  
    ow_reset();
    ow_writebyte(0xcc); //跳过读序号列号的操作  
    ow_writebyte(0x44); //启动温度转换 
  
    ow_reset();
    ow_writebyte(0xcc); //跳过读序号列号的操作  
    ow_writebyte(0xbe); //读取温度寄存器  
    t = ow_readbyte(); //读低8位 
	t = t << 8;
    t = ow_readbyte();  //读高8位  

    ft=t * 0.0625;  
    t= tt * 10+0.5; //放大10倍输出并四舍五入  
    return(t);  
} 
/*
 *********************************************************************************************************
 */